// Calculator.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <clocale>
using namespace std; //Чтобы не использовать std:: приставку везде

//Начало программы без подсказок
//int main()
//{
//	int a, b;
//	cin >> a >> b;
//	cout << a + b;
//	return 0;
//}

//Начало программы с подсказками но без кириллицы
//int main()
//{
//	int a, b;
//	cout << "Введи первое число";
//	cin >> a;
//	cout << "Введи Второе число";
//	cin >> b;
//	cout << "Сумма " << a + b;
//	return 0;
//}

//Начало программы с подсказками и кириллицой
int main()
{
	setlocale(LC_ALL, "ru");
	int a, b;
	std::cout << "Введи первое число "; //как бы было без using namespace std;
	cin >> a;
	cout << "Введи Второе число ";
	cin >> b;
	cout << "Сумма " << a + b << endl; //endl нужен для перевода на другую строку 
	cin.get(); // чтобы поймать Enter после второго числа
	cin.get(); // ожидание ввода
	return 0;
}

//Git

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
